Repository: s-lib/SpineHelper
Catalog: SpineHelper/GlobalStrings.*.resx
Languages: pl_pl

source: Arrows
pl_pl: Strzały

# CalibrationApplyHeader
source: Saving data to the device
pl_pl: Zapisywanie danych w urządzeniu

# CalibrationApplySensor
source: You are trying to set new device scale factor for {0} weighting sensor. New value: {1} Do you wish to continue?
pl_pl: Próbujesz zapisać w urządzeniu nową wartość kalibracyjną dla {0} sensora wagowego. Zapisywana wartość: {1} Chcesz kontynuować?

# CalibrationApplySpine
source: You are trying to set new spine fixed deflection (spine calculation factor) for the device. Previous value: {0} New value: {1} Do you wish to continue?
pl_pl: Próbujesz zapisać w urządzeniu nowy dystans kalibracyjny spinetestera (wartość do kalkulacji spinu). Poprzednia wartość: {0} Nowa wartość: {1} Chcesz kontynuować?

# CalibrationBegin
source: Begin Calibration
pl_pl: Rozpocznij kalibrację

# CalibrationLeftUpper
source: LEFT
pl_pl: LEWEGO

# CalibrationResetPopup
source: This will restore the device to factory settings. Are you sure you want to continue?
pl_pl: Ta opcja przywróci urządzenie do ustawień fabrycznych. Chcesz kontynuować?

# CalibrationResetPopupHeader
source: Restoring Factory Settings
pl_pl: Przywracanie ustawień fabrycznych

# CalibrationRightUpper
source: RIGHT
pl_pl: PRAWEGO

# CalibrationSensors
source: Calibrate Weighting Sensors
pl_pl: Kalibracja sensorów wagowych

# CalibrationSpine
source: Calibrate Spinetester
pl_pl: Kalibracja spinetestera

# CalibrationStop
source: Stop
pl_pl: Zatrzymaj

# DebugModeInfo
source: DEBUG MODE:
pl_pl: DEBUGOWANIE:

source: Error
pl_pl: Błąd

# ErrorOpeningWebPage
source: Error while opening the web page! Error Message:
pl_pl: Wystąpił błąd podczas próby otwarcia strony WWW! Komunikat błędu:

# ExportError
source: Exporting failed! Error with selected file type: Unsupported type. FileFilterIndex = {0} Error: {1}
pl_pl: Eksportowanie nie powiodło się! Błąd z wybranym typem pliku: nieobsługiwany typ. FileFilterIndex = {0} Komunikat błędu: {1}

# GrainsLowcase
source: grains
pl_pl: grany

# GramsLowcase
source: grams
pl_pl: gramy

# HistoryViewColumnAMO1
source: 1st AMO
pl_pl: 1. AMO

# HistoryViewColumnAMO2
source: 2nd AMO
pl_pl: 2. AMO

# HistoryViewColumnASTM1
source: 1st ASTM
pl_pl: 1. ASTM

# HistoryViewColumnASTM2
source: 2nd ASTM
pl_pl: 2. ASTM

# HistoryViewColumnComment
source: Comment
pl_pl: Komentarz

# HistoryViewColumnGrains
source: Grains
pl_pl: Grany

# HistoryViewColumnGrams
source: Grams
pl_pl: Gramy

# HistoryViewColumnStraightness
source: Straightness
pl_pl: Dokładność

# InstallDriversUSB
source: Program will install Spinetester USB drivers. Do you wish to continue?
pl_pl: Program zainstaluje sterowniki USB Spinetestera, konieczne do podłączenia go do komputera. Chcesz kontynuować?

# InstallDriversUSBHeader
source: Install Spinetester Drivers
pl_pl: Zainstaluj sterowniki USB Spinetestera

# NotConnectedPopup
source: The device is not connected! Make sure you selected correct COM port and your USB cable is not damaged. If you didn't install the device USB drivers already, you can do this by using menu Device -> Install USB drivers.
pl_pl: Urządzenie nie jest podłączone! Upewnij się, że wybrano prawidłowy port COM i że połączenie kablowe jest sprawne. Jeśli do tej pory nie zainstalowano sterowników, zrób to korzystając z menu Sprzęt- > Zainstaluj sterowniki USB.

# NotConnectedPopupHeader
source: Device Not Connected
pl_pl: Urządzenie nie wykryte

# SerializerExportSuccessful
source: Your history has been successfully exported.
pl_pl: Twoja historia została pomyślnie wyeksportowana.

# SerializerExportSuccessfulHeader
source: Export Successful
pl_pl: Eksportowanie udane

# SerializerExportToFile
source: Export to a file
pl_pl: Eksportuj do pliku

# SerializerLoadError
source: Loading failed! Error message:
pl_pl: Wczytywanie nie powiodło się! Komunikat błędu:

# SerializerLoadSuccessful
source: Your history has been successfully loaded.
pl_pl: Zapisana historia testów została pomyślnie wczytana.

# SerializerLoadSuccessfulHeader
source: Loading Successful
pl_pl: Udane wczytywanie

# SerializerLoadWarning
source: Loading saved arrow set will clear current results. Do you want to continue?
pl_pl: Otwieranie zapisanego pliku z danymi spowoduje wyczyszczenie obecnej historii wyników. Chcesz kontynuować?

# SerializerLoadWarningHeader
source: Load saved arrow data
pl_pl: Otwieranie zapisanego pliku

# SerializerOpenFile
source: Open a saved data file
pl_pl: Otwórz zapisany plik z danymi

# SerializerSaveError
source: Saving failed! Error message:
pl_pl: Zapisywanie się nie powiodło! Komunikat błędu:

# SerializerSaveSuccessful
source: Your history has been successfully saved.
pl_pl: Historia testów została pomyślnie zapisana.

# SerializerSaveSuccessfulHeader
source: Saving Successful
pl_pl: Udany zapis

# SerializerSaveToFile
source: Save data to a file
pl_pl: Zapisz dane do pliku

# DeviceConnected
source: Connected
pl_pl: Połączono

# DeviceConnecting
source: Connecting...
pl_pl: Łączenie...

# DeviceIsReady
source: Device Ready
pl_pl: Urządzenie gotowe

# DeviceNotConnected
source: Not Connected
pl_pl: Nie połączono

# HistoryClear
source: Do you want to clear all the history?
pl_pl: Chcesz usunąć całą historię pomiarów?

# HistoryClearHeader
source: Clear All History
pl_pl: Wyczyść całą historię

# HistoryRemoveEntry
source: Do you want to remove the latest history entry?
pl_pl: Chcesz usunąć ostatni (najnowszy) wpis z historii?

# HistoryRemoveEntryHeader
source: Remove Entry
pl_pl: Usuń wpis

# NoDataToExport
source: No data to export. History is empty.
pl_pl: Brak danych do wyeksportowania. Historia pomiarów jest pusta.

# UpdateApplicationError
source: This application cannot be updated. It is likely not a ClickOnce application. Error:
pl_pl: Ta aplikacja nie może zostać zaktualizowana. Prawdopodobnie nie jest to aplikacja typu ClickOnce. Błąd:

# UpdateApplicationErrorHeader
source: Application Error
pl_pl: Błąd aplikacji

# UpdateAvailable
source: An update is available. Would you like to update the application now?
pl_pl: Dostępna jest nowa wersja aplikacji. Chcesz zaktualizować aplikację teraz?

# UpdateAvailableHeader
source: Update Available
pl_pl: Znaleziono aktualizację

# UpdateConnectionError
source: The new version of the application cannot be downloaded at this time. Please check your network connection, or try again later. Error:
pl_pl: Nowa wersja aplikacji nie może zostać pobrana w tej chwili. Sprawdź swoje połączenie sieciowe lub spróbuj później. Błąd:

# UpdateConnectionErrorHeader
source: Connection Error
pl_pl: Błąd połączenia

# UpdateErrorNet
source: Cannot install the latest version of the application. Please check your network connection, or try again later. Error:
pl_pl: Nie można zainstalować najnowszej wersji aplikacji. Sprawdź swoje połączenie sieciowe lub spróbuj później. Błąd:

# UpdateFatalError
source: Something went very wrong while checking for updates... You shouldn't be seeing this.
pl_pl: Coś poszło bardzo nie tak przy próbie wyszukania aktualizacji. Ten komunikat w ogóle nie powinien się wyświetlić.

# UpdateForced
source: This application has detected a mandatory update from your current version to version {0}. The application will now install the update and restart.
pl_pl: Wykryto obowiązkową aktualizację z Twojej obecnej wersjido wersji {0}. Aplikacja zainstaluje teraz aktualizacje i uruchomi się ponownie.

# UpdateInstallationError
source: Cannot check for a new version of the application. The ClickOnce deployment is corrupt. Please redeploy the application and try again. Error:
pl_pl: Nie można wyszukać aktualizacji. Pliki ClickOnce są wadliwe. Błąd:

# UpdateInstallationErrorHeader
source: Installation Error
pl_pl: Błąd instalacji

# UpdateInstalled
source: The application has been updated, and will now restart.
pl_pl: Aplikacja została zaktualizowana i zostanie teraz uruchomiona ponownie.

# UpdateNotDeployed
source: Cannot check for updates.
pl_pl: Nie można wyszukać aktualizacji.

# UpdateUpToDate
source: You have the latest version of the application.
pl_pl: Posiadasz najnowszą wersję aplikacji.

# UpdateUpToDateHeader
source: Application is up-to-date
pl_pl: Aplikacja jest aktualna

# ConnectFound
source: Found {0}!
pl_pl: Znaleziono {0}!

# ConnectFoundPort
source: New COM port found!
pl_pl: Znaleziono nowy port COM!

# ConnectionUSBName
source: Spinetester USB at
pl_pl: Spinetester USB na

# DeviceCommandAllDone
source: Remove the Arrow...
pl_pl: Zdejmij strzałę...

# DeviceCommandReady
source: Place the Arrow...
pl_pl: Umieść strzałę...

# DeviceCommandTestSpine
source: Bend the Arrow...
pl_pl: Dociśnij strzałę...

# DeviceCommandTestSpine2
source: Rotate Arrow and Bend Again...
pl_pl: Obróć strzałę i dociśnij...

# DeviceCommandWait
source: Wait...
pl_pl: Czekaj...

# DeviceSpine1Test
source: Testing Spine 1...
pl_pl: Sprawdzanie spinu 1...

# DeviceSpine1TestDone
source: Spine 1 Test Done
pl_pl: Spin 1 zapisany

# DeviceSpine2Test
source: Testing Spine 2...
pl_pl: Sprawdzanie spinu 2...

# DeviceSpine2TestDone
source: Spine 2 Test Done
pl_pl: Spin 2 zapisany

# DeviceStraightness
source: All Tests Done
pl_pl: Wszystkie testy ukończone

# DeviceWeightCalibration
source: Calibrating Sensors...
pl_pl: Kalibrowanie sensorów...

# DeviceWeightTest
source: Testing Weight...
pl_pl: Sprawdzanie wagi...

# DeviceWeightTestDone
source: Weight Test Done
pl_pl: Waga zapisana

# HistoryViewRemoveArrow
source: Remove Selected Arrow
pl_pl: Usuń zaznaczoną strzałę

# HistoryViewRemoveArrows
source: Remove Selected Arrows
pl_pl: Usuń zaznaczone strzały

# HistoryViewRemoveArrowsConfirmation
source: Do you really want to remove selected arrows from your history?
pl_pl: Czy naprawdę chcesz usunąć z historii zaznaczone strzały?

# CalibrationApplyHX711
source: You are trying to set new sensors' amplifier update frequency for the device. Previous value: {0} New value: {1} Do you wish to continue?
pl_pl: Próbujesz zapisać w urządzeniu nową częstotliwość odświeżania dla wzmacniaczy sygnału sensorów. Poprzednia wartość: {0} Nowa wartość: {1} Chcesz kontynuować?

# CalibrationApplySpineDiff
source: You are trying to set new spine difference threshold (spine calculation factor) for the device. Previous value: {0} New value: {1} Do you wish to continue?
pl_pl: Próbujesz zapisać w urządzeniu nową wartość progu przy badania spinu. Poprzednia wartość: {0} Nowa wartość: {1} Chcesz kontynuować?

# DeviceConnectWith
source: Connect with
pl_pl: Połącz z

# CalibrationInstructionsSpine
source: Instructions: 1. Select a high quality carbon shaft with known exact spine - this shaft will be used as a reference. The better and straighter the shaft will be, the more precise value you'll get. 2. Enter the shaft's known spine in ASTM (preferred) or AMO standard ic correct box. 3. Switch to the main application window without closing this one and do a full test (2 spine tests) of the selected shaft. 4. After the test switch back to this window without taking the shaft off the device. 5. Click "Calculate Deflection". 6. Your new calibration value should be ready. You can click "Apply To Device" to save the new value - a confirmation window will appear before the value will be send to the device. NOTE! You can also manually enter the calibration value without doing the tests, but the method described above is the suggested way.
pl_pl: Instrukcje: 1. Wybierz wysokiej jakości promień karbonowy o znanym dokładnie spine'ie - ten promień posłuży do obliczania nowej wartości kalibracyjnej. Im prostszy i dokładniejszy promień, tym dokładniejszy będzie rezultat. 2. Wpisz znany spine promienia w standardzie ASTM (zalecane) albo AMO w odpowiednią rubrykę. 3. Wróć do głównego okna aplikacji i wykonaj pełny test na wybranym promieniu. Nie zamykaj tego okna. 4. Po wykonaniu testu wróć do niniejszego okna, nie zdejmując promienia z urządzenia. 5. Kliknij "Oblicz dystans ugięcia". 6. Nowa wartość kalibracyjna jest gotowa! Możesz kliknąć "Zapisz w urządzeniu" aby ją zastosować - zanim zostanie ona wysłana do urządzenia, pojawi się jeszcze dodatkowe okno w którym musisz potwierdzić chęć zapisania zmian. UWAGA! Możesz też ręcznie wpisać wartość kalibracyjną bez wykonywania żadnych testów, ale sposób podany powyżej jest sposobem zalecanym.

# CalibrationInstructionsWeight
source: Instructions: 1. Select a weighting item you're going to use for the calibration. You should know the exact weight of the item. It's best to use 25-100 gram weights with 0,01g precision. 2. Enter the weight of the item into the correct box (gram or grain). 3. Select the sensor you'd like to calibrate - left or right. 4. Click "Tare" to tare/zero the device. 5. Place the weight on the selected sensor. 6. Click "Begin Calibration" and wait around 20-30 seconds. 7. Click "Stop" to end testing the weight. 8. Your new calibration value is ready. You can click "Apply To Device" to save the new value - a confirmation window will appear before the value will be send to the device.
pl_pl: Instrukcje: 1. Wybierz odważnik o znanej dokładnej wadze. Najlepiej stosować odważniki 25-100 gramów z dokładnością do 0,01 grama. 2. Wpisz wagę odważnika do odpowiedniej rubryki, w gramach (zalecane) lub granach. 3. Wybierz sensor, który chcesz skalibrować - lewy czy prawy. 4. Kliknij "Taruj" aby wyzerować urządzenie przed testem. 5. Umieść odważnik na wybranym sensorze. 6. Kliknij "Rozpocznij kalibrację" i zaczekaj 20-30 sekund aż urządzenie wykona serię testów. 7. Kliknij "Zatrzymaj" gdy będziesz chcieć zakończyć test. 8. Nowa wartość kalibracyjna jest gotowa! Możesz kliknąć "Zapisz w urządzeniu" aby zastosować nową wartość - zanim zostanie ona wysłana do urządzenia, pojawi się jeszcze dodatkowe okno w którym musisz potwierdzić chęć zapisania zmian.

# LanguageUnknown
source: Unknown
pl_pl: Nieznany

# CalibrationApplyLanguage
source: You are trying to set new language for the device. Previous language: {0} New language: {1} Do you wish to continue?
pl_pl: Próbujesz zmienić język komunikatów w urządzeniu. Poprzedni język: {0} Nowy język: {1} Chcesz kontynuować?

# CalibrationApplyVolume
source: You are trying to set new speaker volume in the device. Previous value: {0} New value: {1} Do you wish to continue?
pl_pl: Próbujesz ustawić w urządzeniu nową wartość głośności. Poprzednia głośność: {0} Nowa głośność: {1} Chcesz kontynuować?
