Repository: s-lib/SpineHelper
Catalog: SpineHelper/View/Options/PreferencesForm.*.resx
Languages: pl_pl

# buttonCancel.Text
source: Cancel
pl_pl: Anuluj

# buttonUpdate.Text
source: Check Now
pl_pl: Sprawdź teraz

# buttonUpdate.ToolTip
source: Checks if application updates are available. Requires Internet connection.
pl_pl: Sprawdza czy są dostępne aktualizacje aplikacji. Wymaga aktywnego połączenia internetowego.

# checkBoxAutoUpdates.Text
source: Automatically check for updates at application start
pl_pl: Automatycznie sprawdzaj dostępność aktualizacji

# checkBoxAutoUpdates.ToolTip
source: With this option enabled application will check for updates each time it is launched. You can disable it if you don't have Internet connection, don't want to update or just want to update manually. Enabled by default.
pl_pl: Gdy ta opcja jest aktywna program przy każdym uruchomieniu będzie sprawdzał czy dostępne są aktualizacje oprogramowania. Możesz wyłączyć tę opcję jeśli nie masz połączenia internetowego, nie chcesz uaktualniać aplikacji lub gdy chcesz uaktualniać wyłącznie samodzielnie. Domyślnie włączone.

# groupUpdate.Text
source: Updates
pl_pl: Aktualizacje

# buttonRestart.Text
source: Restart Now
pl_pl: Zrestartuj teraz

# buttonRestart.ToolTip
source: Restarts the application. Unsaved History will be lost.
pl_pl: Uruchamia aplikację ponownie. Niezapisana historia pomiarów zostanie utracona.

# labelRestart.Text
source: Selected changes will take full effect after next application launch
pl_pl: Wybrane zmiany zostaną w pełni zastosowane przy następnym uruchomieniu programu

# labelResultsSize.Text
source: Result Area Size:
pl_pl: Obszar wyników:

# labelResultsSize.ToolTip
source: Sets the size of current arrow testing area.
pl_pl: Ustawia rozmiar elementów interface'u testowanej strzały. Pełne zmiany wymagają ponownego uruchomienia aplikacji.

# comboBoxResultsSize.Items
source: Default
pl_pl: Domyślny rozmiar

# comboBoxResultsSize.ToolTip
source: Sets the size of current arrow testing area.
pl_pl: Ustawia rozmiar elementów interface'u testowanej strzały. Pełne zmiany wymagają ponownego uruchomienia aplikacji.

# labelColorScheme.Text
source: Color Scheme:
pl_pl: Schemat kolorów:

# labelColorScheme.ToolTip
source: Sets the application's color scheme.
pl_pl: Ustawia schemat kolorów interface'u aplikacji. Pełne zmiany wymagają ponownego uruchomienia aplikacji.

# comboBoxColorScheme.Items
source: Default
pl_pl: Domyślny

# comboBoxColorScheme.ToolTip
source: Sets the application's color scheme.
pl_pl: Ustawia schemat kolorów interface'u aplikacji. Pełne zmiany wymagają ponownego uruchomienia aplikacji.

# labelLanguage.Text
source: Language:
pl_pl: Język:

# labelLanguage.ToolTip
source: Sets the application's UI language.
pl_pl: Ustawia język interface'u aplikacji. Pełne zmiany wymagają ponownego uruchomienia aplikacji.

# comboBoxLanguage.ToolTip
source: Sets the application's UI language.
pl_pl: Ustawia język interface'u aplikacji. Pełne zmiany wymagają ponownego uruchomienia aplikacji.

# groupBoxGeneral.Text
source: General
pl_pl: Ogólne

# checkBoxDebugMode.Text
source: Debug Mode
pl_pl: Tryb debugowania

# checkBoxDebugMode.ToolTip
source: This option turns on diagnostics mode with some application debugging messegase and information. Off by default.
pl_pl: Ta opcja włącza tryb debugowania, z dodatkowymi technicznymi informacjami i powiadomieniami. Raczej zostaw wyłączone, chyba że wiesz co robisz. ( ͡° ͜ʖ ͡°)

# groupBoxDiagnostics.Text
source: Diagnostics
pl_pl: Diagnostyka

# checkBoxConfirmHistoryRemove.Text
source: On History Remove Latest Entry
pl_pl: Przy usuwaniu najnowszego wpisu z historii

# checkBoxConfirmHistoryRemove.ToolTip
source: With this option enabled you'll have to confirm if you want to the latest entry from the history. Disabled by default.
pl_pl: Gdy ta opcja jest aktywna będziesz musieć potwierdzić chęć usunięcia najnowszego wpisu z historii pomiarów. Domyślnie wyłączone.

# checkBoxConfirmHistoryClear.Text
source: On History Clearing
pl_pl: Przy próbie czyszczenia historii

# checkBoxConfirmHistoryClear.ToolTip
source: With this option enabled you'll have to confirm if you want to erase the history data table. When disabled, history will be cleared on main button press without additional confirmation. Enabled by default.
pl_pl: Gdy ta opcja jest aktywna będziesz musieć potwierdzić chęć wyczyszczenia historii pomiarów. Gdy jest wyłączona, historia zostanie wyczyszczona bez dodatkowej konieczności potwierdzania. Domyślnie włączone.

# checkBoxNotifySaveLoad.Text
source: On Save/Load/Export File
pl_pl: Po udanym zapisie/odczycie/eksporcie pliku

# checkBoxNotifySaveLoad.ToolTip
source: When this option is enabled you'll get notifications each time file is saved, loaded or exported successfully. When disabled, you'll get notifications only when something goes wrong. Enabled by default.
pl_pl: Gdy ta opcja jest włączona otrzymasz powiadomienie za każdym razem gdy zapisywanie odczytywanie i eksport pliku zakończą się pomyślnie. Gdy jest wyłączona, otrzymasz powiadomienia tylko w przypadku niepowodzenia. Domyślnie włączone.

# groupBoxNotifications.Text
source: Notifications
pl_pl: Powiadomienia

# checkBoxSimplifiedConnection.Text
source: Simplified Connection Info
pl_pl: Uproszczone informacje o połączeniu

# checkBoxSimplifiedConnection.ToolTip
source: With this option turned on you will not see the details on current device status like "Testing spine..." or "Weight test done" near the connection panel. You will also not see the text tips like "Bend the arrow" or "Remove the arrow" below the device status. Off by default.
pl_pl: Gdy ta opcja jest aktywna, nie będziesz widzieć dodatkowych komunikatów o aktualnym stanie urządzenia jak "Testowanie spinu 1..." czy "Waga zapisana" znajdujących się przy panelu połączenia. Nie będziesz też widzieć tekstowych podpowiedzi typu "Dociśnij strzałę" czy "Zdejmij strzałę" pod statusem połączenia. Domyślnie wyłączone.

# groupBoxConnection.Text
source: Connection
pl_pl: Łączność

# $this.Text
source: Preferences
pl_pl: Ustawienia
